app/Controllers/C_Master_pegawai.php

    public function tambah_data()
    {
        $validate = $this->validate([
            'id_pegawai' => 'required'
        ]);
        if ($validate) {
            $data = array(
                'id_master_pegawai' => $this->request->getVar('id_master_pegawai'),
                'id_pegawai' => $this->request->getVar('id_pegawai'),
                'id_jabatan' => $this->request->getVar('id_jabatan'),
                'id_sub_bagian' => $this->request->getVar('id_sub_bagian'),
            );
            $model = new M_master_pegawai();
            $model->tambah($data);
            return redirect()->to(base_url('master_pegawai'));
        }
        $pegawai = new M_pegawai();
        $jabatan = new M_jabatan();
        $sub_bagian = new M_sub_bagian();
        $data['pegawais'] = $pegawai->findAll();
        $data['jabatans'] = $jabatan->findAll();
        $data['sub_bagians'] = $sub_bagian->findAll();
---
SELECT *
FROM `pegawai`
SELECT *
FROM `jabatan`
SELECT *
FROM `sub_bagian`

    public function edit($id_master_pegawai)
    {
        $m_master_pegawai = new M_master_pegawai();
        $master_pegawai = $m_master_pegawai->detail($id_master_pegawai);

        $validate = $this->validate([
            'id_pegawai' => 'required'
        ]);
        if ($validate) {
            $data = array(
                'id_master_pegawai' => $this->request->getVar('id_master_pegawai'),
                'id_pegawai' => $this->request->getVar('id_pegawai'),
                'id_jabatan' => $this->request->getVar('id_jabatan'),
                'id_sub_bagian' => $this->request->getVar('id_sub_bagian'),
            );
            $model = new M_master_pegawai();
            $model->edit($data);
            return redirect()->to(base_url('master_pegawai'));
        }
        $data = array(
            'master_pegawai' => $master_pegawai
        );
        $pegawai = new M_pegawai();
        $jabatan = new M_jabatan();
        $sub_bagian = new M_sub_bagian();
        $data['pegawais'] = $pegawai->findAll();
        $data['jabatans'] = $jabatan->findAll();
        $data['sub_bagians'] = $sub_bagian->findAll();
---
SELECT *
FROM `pegawai`
SELECT *
FROM `jabatan`
SELECT *
FROM `sub_bagian`