app/Controllers/C_Pegawai.php

SELECT *
FROM `pegawai`
---
    public function index()
    {
        $model = new M_pegawai();
        $data['pegawais'] = $model->findAll();