app/Models/M_kinerja_harian.php

SELECT *
FROM `kinerja_harian`
JOIN `master_pegawai` ON `kinerja_harian`.`id_master_pegawai` = `master_pegawai`.`id_master_pegawai`
JOIN `pegawai` ON `pegawai`.`id_pegawai` = `master_pegawai`.`id_pegawai`
JOIN `jabatan` ON `jabatan`.`id_jabatan` = `master_pegawai`.`id_jabatan`
JOIN `sub_bagian` ON `sub_bagian`.`id_sub_bagian` = `master_pegawai`.`id_sub_bagian`
---
    function getAll() {
        $builder = $this->db->table('kinerja_harian');
        $builder->join('master_pegawai', 'kinerja_harian.id_master_pegawai = master_pegawai.id_master_pegawai');
        $builder->join('pegawai', 'pegawai.id_pegawai = master_pegawai.id_pegawai');
        $builder->join('jabatan', 'jabatan.id_jabatan = master_pegawai.id_jabatan');
        $builder->join('sub_bagian', 'sub_bagian.id_sub_bagian = master_pegawai.id_sub_bagian');
        $query = $builder->get();

SELECT *
FROM `kinerja_harian`
JOIN `master_pegawai` ON `kinerja_harian`.`id_master_pegawai` = `master_pegawai`.`id_master_pegawai`
JOIN `pegawai` ON `pegawai`.`id_pegawai` = `master_pegawai`.`id_pegawai`
JOIN `jabatan` ON `jabatan`.`id_jabatan` = `master_pegawai`.`id_jabatan`
JOIN `sub_bagian` ON `sub_bagian`.`id_sub_bagian` = `master_pegawai`.`id_sub_bagian`
WHERE `id_kinerja_harian` = '16'
---
    public function detail($id_kinerja_harian)
    {
        $builder = $this->db->table('kinerja_harian');
        $builder->join('master_pegawai', 'kinerja_harian.id_master_pegawai = master_pegawai.id_master_pegawai');
        $builder->join('pegawai', 'pegawai.id_pegawai = master_pegawai.id_pegawai');
        $builder->join('jabatan', 'jabatan.id_jabatan = master_pegawai.id_jabatan');
        $builder->join('sub_bagian', 'sub_bagian.id_sub_bagian = master_pegawai.id_sub_bagian');
        $builder->where(array('id_kinerja_harian' => $id_kinerja_harian));
        $query = $builder->get();