app/Models/M_master_pegawai.php

SELECT *
FROM `master_pegawai`
JOIN `pegawai` ON `pegawai`.`id_pegawai` = `master_pegawai`.`id_pegawai`
JOIN `jabatan` ON `jabatan`.`id_jabatan` = `master_pegawai`.`id_jabatan`
JOIN `sub_bagian` ON `sub_bagian`.`id_sub_bagian` = `master_pegawai`.`id_sub_bagian`
---
    function getAll() {
        $builder = $this->db->table('master_pegawai');
        $builder->join('pegawai', 'pegawai.id_pegawai = master_pegawai.id_pegawai');
        $builder->join('jabatan', 'jabatan.id_jabatan = master_pegawai.id_jabatan');
        $builder->join('sub_bagian', 'sub_bagian.id_sub_bagian = master_pegawai.id_sub_bagian');
        $query = $builder->get();